software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/CQL2-allSites.xml

<soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:dat="http://org.cagrid.dataservice/DataService"
xmlns:cql2="http://CQL.caBIG/2/org.cagrid.cql2">
   <soapenv:Header/>
   <soapenv:Body>
      <dat:ExecuteQueryRequest>
         <dat:query>
            <cql2:CQLQuery>
               <cql2:CQLTargetObject className="edu.wustl.catissuecore.domain.Site"/>
               <cql2:AssociationPopulationSpecification>
                  <cql2:NamedAssociationList>
                     <cql2:NamedAssociation endName="assignedSiteUserCollection"/>
                  </cql2:NamedAssociationList>
               </cql2:AssociationPopulationSpecification>
            </cql2:CQLQuery>
         </dat:query>
      </dat:ExecuteQueryRequest>
   </soapenv:Body>
</soapenv:Envelope>